[
{
    "TITLE": "Introduction to Computer Engineering",
    "ID": "CMPE-110",
    "DESC": "This course overviews the field of computer engineering, the computer engineering curriculum at RIT, and research and career opportunities. The topics covered include basic circuit analysis, number systems, digital logic, programming, robotics, laboratory equipment, teamwork, critical thinking, technical writing, modern and contemporary issues, ethics, diversity, and communication skills."
},
{
    "TITLE": "Digital System Design I",
    "ID": "CMPE-160",
    "DESC": "This course covers the specification, analysis, modeling and design of digital systems. Standard modules, such as decoders, multiplexers, shifter registers, adders, and counters, will be analyzed. Lectures will discuss fundamental design methodologies, state machines, and digital system modeling with the use of VHDL as a hardware description language. The laboratory provides hands-on experiences of the design, modeling, implementation, and testing of digital systems using commercial IC components as well as CAD tools. Co-requisite: CSCI-105 or CSCI-140 or CSCI-141 or equivalent course.  "
},
{
    "TITLE": "Assembly and Embedded Systems",
    "ID": "CMPE-250",
    "DESC": "This course introduces embedded systems, along with fundamental computer organization, assembly language programming, and mixed language programming with C and assembly. Using a modern microcontroller and embedded systems IDE, such as the ARM Cortex-M0+ and Keil Microcontroller Development Kit, the course covers embedded programming concepts and interface modules, as well as addressing methods, machine instructions, assembler directives, macro definitions, code relocatability, subroutine linkage, data structures, I/O programming, exception processing, and interrupts. Program design techniques necessary to write efficient, maintainable device drivers are considered. Prerequisites: CMPE-160 or EEEE-120 or equivalent courses. Co-requisites: CSCI-140 or CSCI-142 or CSCI-242 or equivalent courses.  "
},
{
    "TITLE": "Digital System Design II",
    "ID": "CMPE-260",
    "DESC": "This course presents modern approaches to the design, modeling and testing of digital system. Topics covered are: VHDL and Verilog HDL as hardware description languages (HDLs), simulation techniques, design synthesis, verification methods, and implementation with field programmable gate arrays (FPGAs). Combinational and both the synchronous and asynchronous sequential circuits are studied. Testing and design for testability techniques are emphasized and fault tolerant and fail safe design concepts are introduced. Laboratory projects that enable students gain hands-on experience are required. The projects include complete design flow: design of the system, modeling using HDLs, simulation, synthesis and verification. Prerequisites: CMPE-160 or CMPE-161 or equivalent courses. Co-requisites: PHYS-212 or PHYS-208 or EEEE-281 or equivalent courses.  "
},
{
    "TITLE": "Computer Organization",
    "ID": "CMPE-350",
    "DESC": "The course covers the important aspects of the design, organization, and performance evaluation of modern computer systems. Topics include computer performance measures, instruction set architecture classification, input/output organization, CPU datapath and control unit design, microprogramming, arithmetic and logic unit design, and the memory hierarchy, including cache levels and virtual memory. Prerequisites: CMPE-250 or equivalent course. "
},
{
    "TITLE": "Introduction to Hardware Security",
    "ID": "CMPE-361",
    "DESC": "todo"
},
{
    "TITLE": "Applied Programming in C",
    "ID": "CMPE-380",
    "DESC": "This course uses the C language to implement algorithms used in the numerical solution of common problems encountered in science and engineering. Topics include an introduction to C, computer number representation and roundoff error, algorithms for finding roots of nonlinear equations, interpolation, threading, software security, numerical differentiation and integration, function approximation and data fitting solutions to systems of linear equations, and general matrix manipulation. Prerequisites: MATH-241 and CMPE-250 or equivalent courses.  "
},
{
    "TITLE": "Digital Signal Processing",
    "ID": "CMPE-480",
    "DESC": "todo"
},
{
    "TITLE": "Reconfigurable Computing",
    "ID": "CMPE-660",
    "DESC": "todo"
},
{
    "TITLE": "Hardware/Software Codesign for Cryptographic Applications",
    "ID": "CMPE-660",
    "DESC": "todo"
},
{
    "TITLE": "Deep Learning",
    "ID": "CMPE-679",
    "DESC": "todo"
},
{
    "TITLE": "Special Topics",
    "ID": "CMPE-789",
    "DESC": "todo"
},
{
    "TITLE": "Computer Science I",
    "ID": "CSCI-141",
    "DESC": "This course serves as an introduction to computational thinking using a problem-centered approach. Specific topics covered include: expression of algorithms in pseudo code and a programming language; functional and imperative programming techniques; control structures; problem solving using recursion; basic searching and sorting; elementary data structures such as lists, trees, and graphs; and correctness, testing and debugging. Assignments (both in class and for homework) requiring a pseudo code solution and an implementation are an integral part of the course. An end-of-term project is also required."
},
{
    "TITLE": "Digital Electronics",
    "ID": "EEEE-380",
    "DESC": "This is an introductory course in digital MOS circuit analysis and design. The course covers the following topics: (1) MOSFET I-V behavior in aggressively scaled devices; (2) Static and dynamic characteristics of NMOS and CMOS inverters; (3) Combinational and sequential logic networks using CMOS technology; (4) Dynamic CMOS logic networks, including precharge-evaluate, domino and transmission gate circuits; (5) Special topics, including static and dynamic MOS memory, and interconnect RLC behavior. Prerequisites: EEEE-281 or equivalent course. "
}
]